app/controllers/post_comments_controller.rb

  def create
    post_image = PostImage.find(params[:post_image_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.post_image_id = post_image.id
    comment.save
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "post_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "asdasda"], ["user_id", 1], ["post_image_id", 1], ["created_at", "2021-07-24 09:43:46.104817"], ["updated_at", "2021-07-24 09:43:46.104817"]]

  def destroy
    PostComment.find_by(id: params[:id], post_image_id: params[:post_image_id]).destroy
---
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 3]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? AND "post_comments"."post_image_id" = ? LIMIT ?  [["id", 3], ["post_image_id", 1], ["LIMIT", 1]]