app/views/post_images/show.html.erb

      <%= link_to post_image_favorites_path(@post_image), method: :delete do %>
        ♥<%= @post_image.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_image_id" = ?  [["post_image_id", 1]]

<div class="comments">
<p>コメント件数：<%= @post_image.post_comments.count %></p>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 1]]